"""2) გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც 
შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ
 მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება
   თითოეულ მოვლენას"""
#შევქმენი ცვლადი ჰობი
hobby = "sleep"
#შევქმენი ცვლადი ჩემი მესიჯი
my_message = "hello world"

#დავპრინტე ეს ორი ცვლადი
print("i like to " + hobby + "a lot. " + my_message)
#შევქმენი ორი ინტეგერი ინფუთის გამოყენებით
num1 = input("choose a number: ")
num2 = input("choose a number: ")
#დავპრინტე ეს ორი ინტეგერი
print(int(num1) + int(num2))

#სტრინგზე ჩვენ არ შეგვიძლია მათემატიკური ამოცანების ჩატარება რადგან წინადადებას ვერ დავამატებთ ერთმანეთს, რადგან სტრინგი ითვლება
#ტექსტად. ინტეგერზე ჩვენ შეგვიძლია მათემატიკური ამოცანების ჩატარება რადგაინ ისინი არის რიცხვები