// 1) დაწერეთ რა არის პრიმიტიული და კომპლექსური მნიშვნელობები, ასევე თქვენი სიტყვებით ახსენით რა არის stack & heap მეხსიერებები მოიყვანეთ მაგალითი თითოეულზე. საბოლოოდ დაწერეთ რა არის memory leak და აიღეთ ერთ-ერთი მაგალითი (არ გაუშავთ)

// პრიმიტიულია მარტივი მნიშვნელობა მაგ: 
let age = 17
let name = "luka"
let something = true


//კომპლექსურია რთული მნიშვნელობა 

let a = 17;
let b = a;


//stack მეხსიერებაში ინახება პატარა და მარტივი მონაცემები
let sm1 = {name: "luka"};
let sm2 = sm1; //heap 

sm1.name = "luka2"

let arr = [];

//memory leak არის როდესაც კოდი უსასრულოდ იმეორებს არასაჭირო ინფორმაციას.
function addData() {
    addData()
}


addData()