"""2) შექმენით ცივი სასმელების სია აქედან ერთ-ერთი ელემენტი უნდა ეწეროს ცვლადის სახით, შემდეგ მომხმარებელს შემოტანინეთ 1 ცივი სასმელი რომელსაც დაამატებთ თქვენს მაცივარში. შემდეგ მომხარებელს უნდა შემოატანინოთ არჩევანი ამ სასმელებიდან და სიიდან ელემენტის წამოღების indexing method-ის საშვალებით გამოუტანეთ ეს სასმელი. შექმენით ცვლადი რომელშიც შეინახავთ თქვენს სახელს, გამოიტანეთ ამ სტრინგიდან თქვენთვის სასურველი 3 სიმბოლო"""

drink = "კოკა-კოლა"
user_drink = input("შეიყვანეთ ცივი სასმელი: ")
cold_drinks = [drink, user_drink, "სპრაიტი", "ყინული", "ნატურალური წვენი"]

choose = int(input("აირჩიეთ სასმელი (0-4): "))
print(cold_drinks[choose])

name = "luka"
print(name[0])
print(name[3])
print(name[5])