"""4) შექმენით პროგრამა რომელშიც მომხმარებელმა უნდა შეიყვანოს რიცხვები, სანამ უარყოფითს არ შეიყვანს. დაბეჭდეთ შეყვანილი ლუწი და კენტი რიცხვების რაოდენობა გამოიყენეთ პირობითი განცხადებები"""

number = int(input("შეიყვანეთ რიცხვი: "))
even_count = 0
odd_count = 0
while number >= 0:
    if number % 2 == 0:
        even_count += 1
    else:
        odd_count += 1
    number = int(input("შეიყვანეთ რიცხვი: "))
print(f"შეყვანილი ლუწი რიცხვების რაოდენობა: {even_count}")
print(f"შეყვანილი კენტი რიცხვების რაოდენობა: {odd_count}")