"""5) თითოეულ მათემატიკურ ოპერატორზე (+, -, *, /, %, **, //) შეასრულეთ 5 მაგალითი და დაბეჭდეთ შედეგი"""

# მიმატება +
print(1 + 1)
print(2 + 2)
print(3 + 3)
print(4 + 4)
print(5 + 5)

# გამოკლება -
print(1 - 1)
print(2 - 2)
print(3 - 3)
print(4 - 4)
print(5 - 5)

# გამრავლება *
print(1 * 1)
print(2 * 2)
print(3 * 3)
print(4 * 4)
print(5 * 5)

# გაყოფა /
print(1 / 1)
print(2 / 2)
print(3 / 3)
print(4 / 4)
print(5 / 5)

# მოდული % 
print(1 % 1)
print(2 % 2)
print(3 % 3)
print(4 % 4)
print(5 % 5)

# ხარისხი **
print(1 ** 1)
print(2 ** 2)
print(3 ** 3)
print(4 ** 4)
print(5 ** 5)

# მთელ რიცხვზე გაყოფა //
print(1 // 1)
print(2 // 2)
print(3 // 3)
print(4 // 4)
print(5 // 5)

"""6) კომეტარებით ახსენით თუ რა განსხვავებაა /, //, და % მათემატიკურ ოპერატორებს შორის, დაწერეთ რას აკეთებს თითოეული"""
#/ - არის გაყოფა როდესაც მიღებული პირდაპირ გამოდის ეკრანზე თუნდაც იყოს მთელი
#// - არის მთელ რიცხვზე გაყოფა, ამ დროს თუ მივიღებთ რიცხვს მთელებში ან მოგვრჩება ნაშთი არ გამოჩნდება
#% - არის რიცხვის გაყოფა მაგრამ მას მხოლოდ ნაშთი გამოაქვს ეკრანზე და არა განაყოფი
