"""1) მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული. შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება"""

number = int(input("შეიყვანეთ რიცხვი: "))
if number > 0:
    print("რიცხვი დადებითია")
elif number < 0:
    print("რიცხვი უარყოფითია")
else:
    print("რიცხვი ნეიტრალია")

# if- გამოიყენება ზოგადა კოდის დასაწერად და ნიშნავს იმ შემთხვევაში თუ.
# elif-= ვიყენებთ მაშინ როდესაც სხვა პასუხები არის ბევრი და მოცემული პასუხი არ არის if.