"""1) შექმენით ფუნქცია, greeting რომელიც დააბრუნებს მესიჯს "Hello world". ეს ფუნქია გამოიძახეთ და შეინახეთ ცვლადში, შემდეგ დაბეჭდეთ ცვლადის მნიშვნელობა. საბოლოოდ თქვენი სიტყვებით ახსნით რა განსხვავებაა return-სა და print-ს შორის"""
def greeting():
    return "Hello world"

message = greeting()
print(message)

# განსხვავება return-სა და print-ს შორის ის არის რომ, თუ გვინდა ფუნქციიდან გამოვიტანოთ "გარეთა სამყაროში" ნამუშევარი ფუნქციიდან რეთურნი ამას აკეთებს, თუ მას არ გამოვიყენებთ თითქოს ჩვენ რაც ფუნქციაში რაც გავაკეთეთ ის არ არსებობს.