"""1) პირდაპირ გამოიყენეთ string-ებზე lower, upper, capitalize, მეთოდები კომენტარებით დაწერეთ რა არის მეთოდი რით განსხვავდება ჩვეულებრივი ფუნქციისგან, რა არის dot ნოტაცია. ასევე გააკეთეთ 3 მაგალითი find მეთოდზე, აუცილებლად უნდა იყოს 3 შემთხვევა: error, -1, რაიმე პოზიციას (index)"""



# lower case - აპატარავებს ყველა სიმბოლოს
"WORD".lower() # word 

# upper case - ზრდის ყველა სიმბოლოს  
"word".upper() # WORD

#capitalize - პირველი სიმბოლოს ადიდებს, დანარჩენი პატარა რჩება
"word".capitalize() # Word

print("word".find("o") )
print("word".find("l") )
print("word".find("w") )

#. გამოიყენა ყველა ფუნქციისათვის