"""2) მომხმარებელს input-ის საშვალებით შემოტანინეთ ორი რიცხვი number1 და number2 შემდეგ კი დაბეჭდეთ მათი ჯამი. ასევე შექმენით level-ის ცვლადი რომელშიც მომხამრებელს შემოაყვანინებთ მათ ამჟამინდელ level-ს, შეეცადეთ level-ის მნიშვნელობას დაუმატოთ ერთი და ისე დაბეჭდოთ. მიღებული შედეგებით გამოიტანეთ დასკვნა და დაწერეთ კომენტარებით"""
#შევქმენი პირველი ცვლადი 
num1 = input("think of a number: ")
#შექვქმენი მეორე ცვლადი
num2 = input("think of a second number: ")
#მათი ჯამი დავბეჭდე
print(num1 + " " + num2)

#შევქმენი ცვლადი ლეველი
level = input("what is your level: ")
#პრინტის საშუალებით დავუმატე ერთი და გამოვიყვანე
print(level + str(1))

#პრინტ ფუნქციის გამოყენებით ლეველს დავუმატეთ სტრინგად გადაქცეული 1 და გამოვიტანეთ ეკრანზე