"""1) შექმენით mybalance-ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2-თ უბრალო ფორმით, შემდეგ ისევ გაზარდეთ მნიშვნელობა 
3-ით ოღონდ გამოიყენეთ assigment operator, ამის შემდეგ თქვენი სურვილისამებრ შეცვალეთ ცვლადის მნიშვნელობა იგივე assingment
 operator-ის საშვალებით, კოდი ახსენით კომენატრებით, ჩამოწერეთ ყველა საუკეტესო პრაქტიკა და მიუწერეთ განმარტებები"""
#შევქმენით my_balance ცვლადი რომელიც უდრის 5
my_balance = 5
#გავზარდეთ ის 1-ით
my_balance = my_balance + 1
#გავზარდეთ ის 3-ით
my_balance += 3
#გავზარდეთ ის 3-ჯერ
my_balance *= 3

print(my_balance)
#საუკეთესო პრაქტიკა არის ჰეშთეგების გამოყენება. რადგან ამით ვაწერებთ მოკლე ჩანაწერებს როგორც დღიურში თუ რა რისთვის არის და რას
#აკეთებს
#სნეიქ ქეისიც არის ძალიან კარგი პრაქტიკა რადგან მას ვიყენებთ პითონში 2 ან მეტი სიტყვის შესააერთებლად ისე რომ არ ავურიოთ კოდი