"""1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველი ელემენტები, მინიმუმ 10

indexing
გამოიტანეთ სიაში არსებული მესამე ელემენტი
ჩაანაცვლეთ სიაში არსებული პირველი ელემენტი
slicing
დაბეჭდეთ 2-დან მე-5 ელემენტამდე
დაბეჭდეთ მეორე ელემენტიდან ყველა ელემენტი
დაბეჭდეთ მეხუთე ელემენტამდე ყვეალფერი
დაბეჭდეთ სია შემობრუნებულად"""



სახელები = ['ნიკა', 'გიორგი', 'მარიამ', 'ანა', 'თამარ', 'სალომე', 'ნათია', 'ლუკა', 'დავით', 'მარიამი']

print(სახელები[2])

სახელები[0] = 'ლუკა'

print(სახელები[2:5])

print(სახელები[1:])

print(სახელები[:4])

print(სახელები[::-1])