"""3) შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ შედარების ოპერაციათა შედეგებს, შედარების ოპერაციას გვერდზე კომენტარის საშვალებით მიუწერეთ მისი შედეგი (boolean მნიშვნელობა) და ახსენით რა განსხვავებაა ოპერატორსა და ოპერაციას შორის"""
first = True        #True
second = False      #False
third = 12 > 5      #True
fourth = 100 < 20   #False
third = 200 != 200  #False
# ოპერატორი არის მხოლოდ სიმბოლო, რომელიც განსაზღვრავს, რა უნდა მოხდეს.
# ოპერაცია არის რეალური მოქმედება, რომელიც ხორციელდება ოპერატორის დახმარებით.