// 1) შექმენით Map მონცამეთა ტიპი new Map([])-ის გამოყენებით რომელშიც დაამატეთ 5 მასივს წყვილს, მასზე გამოიყენეთ განხილული მეთდოები: delete, set, has, get, clear, keys, values, entries. შემდეგ შექმენით new Set([])-ის მეშვეობით set მონცამეთა ტიპი 5 ელემენტით და მასზეც გამოიყენეთ მეთოდები: add, delete, clear, has, size, values. კომენტარებით დაწერეთ რომელ მონცემთა თიპს გაგონებთ თითოეული პითონიდან და რატომ

let mymap = new Map(
    [['a', 1],
    ['b', 2], 
    ['c', 3]
]
)

mymap.delete('b') //წაშლის b-ს მაპიდან. პითონიდან მახსენებს pop მეთოდს
mymap.set('d', 4)//დაამატებს d-ს 4-ის მნიშვნელობით. პითონიდან მახსენებს update მეთოდს
mymap.has('a')//შეამოწმებს თუ a-ს აქვს მნიშვნელობა. პითონიდან მახსენებს in ოპერატორს
mymap.get('c')//მიიღბს c-ს მნიშვნელობას. პითონიდან მახსენებს get მეთოდს
mymap.clear() //წაშლის ყველა ელემენტს მაპიდან. პითონიდან მახსენებს clear მეთოდს



console.log(mymap.keys())
console.log(mymap.values())
console.log(mymap.entries())

console.log(mymap)


myset = new Set([1,2,3,4,4,4,5,5,6])
myset.add(7) //ამატებს 7-ს სეტში. პითონიდან მახსენებს add მეთოდს
myset.delete(3) //შლის 3-ს სეტიდან. პითონიდან მახსენებს remove მეთოდს
myset.has(4) //ამოწმებს თუ 4 არის სეტში. პითონიდან მახსენებს in ოპერატორს 
myset.clear() //წაშლის ყველა ელემენტს სეტიდან. პითონიდან მახსენებს clear მეთოდს
console.log(myset.size) //სეტის ზომა. პითონიდან მახსენებს len ფუნქციას
