"""3) ჩამოწერეთ IndexError, NameError, SyntaxError, ZeroDivisionError გამოწვევის მიზეზები. ასევე ახსენით თქვენი სიტყვებით რა გასნხვავებაა Bug-ს და Error-ს შორის. ახსენით რა არის error handling და მისი თითოეული keyword: try, except, else, finally. შემდეგ მოიყვანეთ ერთი error handling მაგალითი რომელშიც იქნება ყველა error handling-ის keyword"""

# IndexError: გამოწვეულია მაშინ, როდესაც მივწვდებით სიის ან ტუპლის ისეთ ელემენტს, რომელიც არ არსებობს (მაგალითად, ინდექსი არის სიის ზომაზე მეტი).
# NameError: გამოწვეულია მაშინ, როდესაც მივწვდებით ცვლადს ან ფუნქციას, რომელიც არ არის განსაზღვრული.
# SyntaxError: გამოწვეულია მაშინ, როდესაც კოდი არ შეესაბამება Python-ის სინტაქსის წესებს (მაგალითად, მიტოვებული ფრჩხილები ან არასრულყოფილი სტრუქტურები).
# ZeroDivisionError: გამოწვეულია მაშინ, როდესაც ვცდილობთ გავყოთ რიცხვი ნულით.
# Bug არის პროგრამის არასწორი ქცევა, რომელიც შეიძლება გამოწვეული იყოს ლოგიკური შეცდომებით კოდში, ხოლო Error არის კონკრეტული პრობლემები, რომლებიც წარმოიქმნება პროგრამის შესრულების დროს (მაგალითად, exceptions).
# Error handling არის პროცესი, რომლის საშუალებითაც პროგრამა მართავს და რეაგირებს შეცდომებზე, რათა თავიდან აიცილოს კრაშები და გაუმჯობესდეს მომხმარებლის გამოცდილება.

